In [2]:
# 시리즈, 데이터프레임

In [3]:
import pandas as pd

In [4]:
s = pd.Series(['banana',42])

In [5]:
s

0    banana
1        42
dtype: object

In [6]:
pd.Series(['Wes Mckinney','Creator of pandas'],index=['Person','Who'])

Person         Wes Mckinney
Who       Creator of pandas
dtype: object

In [8]:
scientists = pd.DataFrame({
    'Name':['rosaline franklin','william Gosset'],
    'Occupation':['chemist','statistician'],
    'Born':['1920-04-7-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]
})

In [9]:
scientists

                Name    Occupation          Born        Died  Age
0  rosaline franklin       chemist  1920-04-7-25  1958-04-16   37
1     william Gosset  statistician    1876-06-13  1937-10-16   61

In [10]:
scientists.index

RangeIndex(start=0, stop=2, step=1)

In [11]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [12]:
scientists.values

array([['rosaline franklin', 'chemist', '1920-04-7-25', '1958-04-16', 37],
       ['william Gosset', 'statistician', '1876-06-13', '1937-10-16', 61]],
      dtype=object)

In [13]:
scientists.keys()

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [15]:
scientists.value_counts('Age')

Age
37    1
61    1
dtype: int64

In [16]:
scientists.mean()

C:\Users\PKNU\AppData\Local\Temp\ipykernel_11956\1491636326.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  scientists.mean()

Age    49.0
dtype: float64

In [17]:
scientists.Age.mean()

49.0

In [19]:
scientists['Age'].mean()

49.0

In [21]:
scientists['Age'].min()

37

In [23]:
scientists['Age'].max()

61

In [25]:
scientists['Age'].std()

16.97056274847714

In [26]:
scientists['Age'].var()

288.0

In [27]:
scientists['Age'].sum()

98

In [29]:
scientists = pd.read_csv('data/scientists.csv')

In [30]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [32]:
ages = scientists['Age']

In [33]:
ages.mean()

59.125

In [36]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [35]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [37]:
scientists[scientists['Age']>scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [39]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [40]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [41]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [43]:
scientists.sort_index(ascending=False)

                   Name        Born        Died  Age          Occupation
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist

In [45]:
scientists.sort_values('Age')

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse

In [48]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [52]:
scientists['Born'] = pd.to_datetime(scientists['Born'])

In [51]:
pd.to_datetime('2000년 3월 7일',format='%Y년 %m월 %d일')

Timestamp('2000-03-07 00:00:00')

In [53]:
scientists['Died'] = pd.to_datetime(scientists['Died'])

In [54]:
scientists['age_days_dt'] = scientists['Died'] - scientists['Born']

In [55]:
scientists

,Name,Born,Died,Age,Occupation,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,28422 days

In [56]:
# 열삭제

In [61]:
scientists.drop(columns='age_days_dt',inplace=True)

In [62]:
scientists

                   Name       Born       Died  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [63]:
scientists.drop(index=[2,5])

                Name       Born       Died  Age          Occupation
0  Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1     William Gosset 1876-06-13 1937-10-16   61        Statistician
3        Marie Curie 1867-11-07 1934-07-04   66             Chemist
4      Rachel Carson 1907-05-27 1964-04-14   56           Biologist
6        Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7       Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [64]:
scientists

                   Name       Born       Died  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [65]:
scientists.to_pickle('test.pickle')

In [66]:
ss = pd.read_pickle('test.pickle')

In [67]:
ss

                   Name       Born       Died  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [68]:
scientists.to_csv('test1.csv',sep='\t')